Tutorial_benchmark_with_CoSimIO/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         pimpleFoam;    // OpenFOAM v1806, OpenFOAM 6, or newer
// application         pimpleDyMFoam; // OpenFOAM v1712, OpenFOAM 5.x, or older

startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             0.01; //25

deltaT              0.001;

writeControl        adjustableRunTime;

writeInterval       0.001;//0.1

purgeWrite          0;

writeFormat         ascii;

writePrecision      10;

writeCompression    off;

timeFormat          general;

timePrecision       12;

functions
{

    KratosOpenfoamAdapterFunctionObject1
    {
        type KratosOpenfoamAdapterFunctionObject;
        libs ("libKratosOpenfoamAdapterFunctionObjectFunctionObjects.so");

        participant Fluid;

        interfaces
        {
            Interface1
            {
                mesh        Fluid-Mesh-Nodes;
                patches     (flap);
                locations   faceNodes;
                readData    (Displacement0);
                writeData   ();
            }

            Interface2
            {
                mesh        Fluid-Mesh-Faces;
                patches     (flap);
                locations   faceCenters;
                readData    ();
                writeData   (Force0);
            }
        }

        Parameters
        {
            rho rho [1 -3 0 0 0 0 0] 1000;
        }
    }

    //To verify Force readData usinf Froce function object
    //forces1
    //{
    //    type                forces;
    //    libs                ("libforces.so");
    //    patches             (flap);
    //    p                   p;
    //    U                   U;
    //    rho  	            rhoInf;
    //    rhoInf              1000;
    //   origin              (5.5 5.97 0.005);
    //    CofR                (0 0 0);
    //    writeFields         yes;
    //    outputControl       timeStep;
    //    outputInterval      1;
    //}

}


// ************************************************************************* //
